class HindiNumbers {
  constructor() {
    this.guess = [];
    this.solution = [];
    this.type = 1;
    const conversions = [
      [31, "इकतीस"],
      [32, "बत्तीस"],
      [33, "तैंतीस"],
      [34, "चौंतीस"],
      [35, "पैंतीस"],
      [36, "छत्तीस"],
      [37, "सैंतीस"],
      [38, "अड़तीस"],
      [39, "उनतालीस"],
      [41, "इकतालीस"],
      [42, "बयालीस"],
      [43, "तैंतालीस"],
      [44, "चौवालीस"],
      [45, "पैंतालीस"],
      [46, "छियालीस"],
      [47, "सैंतालीस"],
      [48, "अड़तालीस"],
      [49, "उनचास"],
      [51, "इक्यावन"],
      [52, "बावन"],
      [53, "तिरेपन"],
      [54, "चौवन"],
      [55, "पचपन"],
      [56, "छप्पन"],
      [57, "सत्तावन"],
      [58, "अट्ठावन"],
      [59, "उनसठ"],
      [61, "इकसठ"],
      [62, "बासठ"],
      [63, "तिरेसठ"],
      [64, "चौंसठ"],
      [65, "पैंसठ"],
      [66, "छियासठ"],
      [67, "सड़सठ"],
      [68, "अड़सठ"],
      [69, "उनहत्तर"],
      [71, "इकहत्तर"],
      [72, "बहत्तर"],
      [73, "तिहत्तर"],
      [74, "चौहत्तर"],
      [75, "पचहत्तर"],
      [76, "छिहत्तर"],
      [77, "सतहत्तर"],
      [78, "अठहत्तर"],
      [79, "उनासी"],
      [81, "इक्यासी"],
      [82, "बयासी"],
      [83, "तिरासी"],
      [84, "चौरासी"],
      [85, "पचासी"],
      [86, "छियासी"],
      [87, "सत्तासी"],
      [88, "अट्ठासी"],
      [89, "नवासी"],
      [91, "इक्यानबे"],
      [92, "बानबे"],
      [93, "तिरानबे"],
      [94, "चौरानबे"],
      [95, "पंचानबे"],
      [96, "छियानबे"],
      [97, "सत्तानबे"],
      [98, "अट्ठानबे"],
      [99, "निन्यानबे"]
    ];

    this.getConversions = () => {
      return conversions;
    };
  }

  getFive(num = 1, type = 1) {
    this.type = type;
    const conversions = this.getConversions(),
      result = new Map(),
      n = conversions.length;

    while (result.size < num) {
      const got = Math.floor(Math.random() * n);
      result.set(conversions[got][0], conversions[got][1]);
    }

    this.guess = this.type ? [...result.keys()] : [...result.values()];
    this.solution = this.type ? [...result.values()] : [...result.keys()];
    return this.guess;
  }

  showSolution() {
    return this.solution;
  }
}

const f = new HindiNumbers();
export default f;
